<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"0e3a41d172932cd6e048a37937e2c2e4682830381a8e5b56efb93f5425b696f5","plan_job_ref":"Job Environment Main - Plan #77 at https://github.com/jarrod-lowe/wildsea/actions/runs/10437265731","plan_out_hash":"828bb01894b24044700a7bb26a9fd73a383197c67ecc3c114b3ff8f91f4e759c","plan_hash":"c3d4d8e264c2f85382619abbbf80e6afaad895e2b47caf134ebe1bfa08c6d23f","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan in __terraform/environment/wildsea__
With backend config: `bucket=terraform-state-021891603679 key=primary/terraform.tfstate region=ap-southeast-2`<details open><summary>With variables</summary>

```hcl
environment       = "primary"
saml_metadata_url = (sensitive value)
```
</details>
<details>
<summary>Plan: 10 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
 <= read (data resources)

Terraform will perform the following actions:

  # module.wildsea.data.aws_iam_policy_document.ui will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "ui" {
+       id            = (known after apply)
+       json          = (known after apply)
+       minified_json = (known after apply)

+       statement {
+           actions   = [
+               "s3:GetObject",
            ]
+           effect    = "Allow"
+           resources = [
+               (known after apply),
            ]
+           sid       = "CDNRead"

+           condition {
+               test     = "StringEquals"
+               values   = [
+                   (known after apply),
                ]
+               variable = "aws:SourceArn"
            }

+           principals {
+               identifiers = [
+                   "cloudfront.amazonaws.com",
                ]
+               type        = "Service"
            }
        }
+       statement {
+           actions   = [
+               "s3:ListBucket",
            ]
+           effect    = "Allow"
+           resources = [
+               (known after apply),
            ]
+           sid       = "CDNList"

+           condition {
+               test     = "StringEquals"
+               values   = [
+                   (known after apply),
                ]
+               variable = "aws:SourceArn"
            }

+           principals {
+               identifiers = [
+                   "cloudfront.amazonaws.com",
                ]
+               type        = "Service"
            }
        }
+       statement {
+           actions   = [
+               "s3:*",
            ]
+           effect    = "Deny"
+           resources = [
+               (known after apply),
+               (known after apply),
            ]
+           sid       = "BlockHTTP"

+           condition {
+               test     = "Bool"
+               values   = [
+                   "false",
                ]
+               variable = "aws:SecureTransport"
            }

+           principals {
+               identifiers = [
+                   "*",
                ]
+               type        = "AWS"
            }
        }
    }

  # module.wildsea.aws_cloudfront_distribution.cdn will be created
+   resource "aws_cloudfront_distribution" "cdn" {
+       arn                             = (known after apply)
+       caller_reference                = (known after apply)
+       continuous_deployment_policy_id = (known after apply)
+       default_root_object             = "index.html"
+       domain_name                     = (known after apply)
+       enabled                         = true
+       etag                            = (known after apply)
+       hosted_zone_id                  = (known after apply)
+       http_version                    = "http2"
+       id                              = (known after apply)
+       in_progress_validation_batches  = (known after apply)
+       is_ipv6_enabled                 = false
+       last_modified_time              = (known after apply)
+       price_class                     = "PriceClass_All"
+       retain_on_delete                = false
+       staging                         = false
+       status                          = (known after apply)
+       tags                            = {
+           "Name" = "Wildsea-primary-cdn"
        }
+       tags_all                        = {
+           "Application" = "Wildsea-primary"
+           "Name"        = "Wildsea-primary-cdn"
        }
+       trusted_key_groups              = (known after apply)
+       trusted_signers                 = (known after apply)
+       wait_for_deployment             = true

+       default_cache_behavior {
+           allowed_methods          = [
+               "GET",
+               "HEAD",
+               "OPTIONS",
            ]
+           cache_policy_id          = "************************************"
+           cached_methods           = [
+               "GET",
+               "HEAD",
            ]
+           compress                 = false
+           default_ttl              = (known after apply)
+           max_ttl                  = (known after apply)
+           min_ttl                  = 0
+           origin_request_policy_id = "************************************"
+           target_origin_id         = (known after apply)
+           trusted_key_groups       = (known after apply)
+           trusted_signers          = (known after apply)
+           viewer_protocol_policy   = "redirect-to-https"
        }

+       origin {
+           connection_attempts      = 3
+           connection_timeout       = 10
+           domain_name              = (known after apply)
+           origin_access_control_id = (known after apply)
+           origin_id                = (known after apply)
#            (1 unchanged attribute hidden)
        }

+       restrictions {
+           geo_restriction {
+               locations        = (known after apply)
+               restriction_type = "none"
            }
        }

+       viewer_certificate {
+           cloudfront_default_certificate = true
+           minimum_protocol_version       = "TLSv1"
        }
    }

  # module.wildsea.aws_cloudfront_origin_access_control.cdn will be created
+   resource "aws_cloudfront_origin_access_control" "cdn" {
+       description                       = "CDN for UI"
+       etag                              = (known after apply)
+       id                                = (known after apply)
+       name                              = "Wildsea-primary-cdn"
+       origin_access_control_origin_type = "s3"
+       signing_behavior                  = "always"
+       signing_protocol                  = "sigv4"
    }

  # module.wildsea.aws_s3_bucket.ui will be created
+   resource "aws_s3_bucket" "ui" {
+       acceleration_status         = (known after apply)
+       acl                         = (known after apply)
+       arn                         = (known after apply)
+       bucket                      = "wildsea-primary-ui"
+       bucket_domain_name          = (known after apply)
+       bucket_prefix               = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       force_destroy               = false
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       object_lock_enabled         = (known after apply)
+       policy                      = (known after apply)
+       region                      = (known after apply)
+       request_payer               = (known after apply)
+       tags                        = {
+           "Name" = "Wildsea-primary-ui"
        }
+       tags_all                    = {
+           "Application" = "Wildsea-primary"
+           "Name"        = "Wildsea-primary-ui"
        }
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)

+       cors_rule (known after apply)

+       grant (known after apply)

+       lifecycle_rule (known after apply)

+       logging (known after apply)

+       object_lock_configuration (known after apply)

+       replication_configuration (known after apply)

+       server_side_encryption_configuration (known after apply)

+       versioning (known after apply)

+       website (known after apply)
    }

  # module.wildsea.aws_s3_bucket_cors_configuration.ui will be created
+   resource "aws_s3_bucket_cors_configuration" "ui" {
+       bucket = (known after apply)
+       id     = (known after apply)

+       cors_rule {
+           allowed_headers = [
+               "*",
            ]
+           allowed_methods = [
+               "GET",
+               "HEAD",
            ]
+           allowed_origins = (known after apply)
+           expose_headers  = [
+               "ETag",
            ]
            id              = null
+           max_age_seconds = 3000
        }
    }

  # module.wildsea.aws_s3_bucket_lifecycle_configuration.ui will be created
+   resource "aws_s3_bucket_lifecycle_configuration" "ui" {
+       bucket = (known after apply)
+       id     = (known after apply)

+       rule {
+           id     = "expire-versions"
+           status = "Enabled"

+           expiration {
+               days                         = 0
+               expired_object_delete_marker = true
            }

+           noncurrent_version_expiration {
+               newer_noncurrent_versions = "5"
+               noncurrent_days           = 30
            }
        }
    }

  # module.wildsea.aws_s3_bucket_ownership_controls.ui will be created
+   resource "aws_s3_bucket_ownership_controls" "ui" {
+       bucket = (known after apply)
+       id     = (known after apply)

+       rule {
+           object_ownership = "BucketOwnerPreferred"
        }
    }

  # module.wildsea.aws_s3_bucket_policy.ui will be created
+   resource "aws_s3_bucket_policy" "ui" {
+       bucket = (known after apply)
+       id     = (known after apply)
+       policy = (known after apply)
    }

  # module.wildsea.aws_s3_bucket_public_access_block.ui will be created
+   resource "aws_s3_bucket_public_access_block" "ui" {
+       block_public_acls       = true
+       block_public_policy     = true
+       bucket                  = (known after apply)
+       id                      = (known after apply)
+       ignore_public_acls      = true
+       restrict_public_buckets = true
    }

  # module.wildsea.aws_s3_bucket_server_side_encryption_configuration.ui will be created
+   resource "aws_s3_bucket_server_side_encryption_configuration" "ui" {
+       bucket = (known after apply)
+       id     = (known after apply)

+       rule {
+           apply_server_side_encryption_by_default {
+               sse_algorithm     = "AES256"
#                (1 unchanged attribute hidden)
            }
        }
    }

  # module.wildsea.aws_s3_bucket_versioning.ui will be created
+   resource "aws_s3_bucket_versioning" "ui" {
+       bucket = (known after apply)
+       id     = (known after apply)

+       versioning_configuration {
+           mfa_delete = (known after apply)
+           status     = "Enabled"
        }
    }

Plan: 10 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Environment Main - Plan #77](https://github.com/jarrod-lowe/wildsea/actions/runs/10437265731)